Repository: Mayar192785/Projects
Catalog: Crystalview/Resources/Views/Home/Index.*.resx
Languages: ar_eg

source: Access from multiple devices
ar_eg: الوصول من أجهزة متعددة

source: Are you sure you want to delete GE_SubSystems
ar_eg: هل متأكد ان تريد مسح GE_SubSytems ؟

source: By leveraging the power of cloud technology, Crystal View enables efficient collaboration, streamlined workflows, and data synchronization across multiple devices, empowering organizations to make informed decisions, optimize resource allocation, and drive productivity regardless of physical boundaries.
ar_eg: من خلال الاستفادة من قوة تقنية السحابة ، يتيح لكريستال فيو التعاون الفعال ، وسير العمل المبسط ، ومزامنة البيانات عبر أجهزة متعددة ، وتمكين المؤسسات من اتخاذ قرارات مستنيرة ، وتحسين تخصيص الموارد, ودفع الإنتاجية بغض النظر عن الحدود المادية.

source: Close
ar_eg: اغلاق

source: Cloud Hosting
ar_eg: استضافة السحابة

source: Create
ar_eg: انشاء

source: Crystal soft is a leading software company in Egypt. Crystal Soft has been established since 2001 and specializes in software development and applications, and also specializes in providing consulting and technical support services. We bring a wide range of software solutions for small and medium-sized businesses and large companies along with training.
ar_eg: كريستال سوفت هي شركة برمجيات رائدة في مصر. تم إنشاء كريستال سوفت منذ عام 2001 وهي متخصصة في تطوير البرمجيات وتطبيقاتها ، كما أنها متخصصة في تقديم خدمات الاستشارات والدعم الفني. نقدم مجموعة واسعة من الحلول البرمجية للشركات الصغيرة والمتوسطة والشركات الكبيرة إلى جانب التدريب.

source: Crystal View program is really one of the best programs I have used, because it is a program built on strong basis, you find comfort and flexibility in use with security, in addition to all the reports for accounting use or for the employer, which helps in making the right decision on time.
ar_eg: برنامج كريستال فيو هو حقًا أحد أفضل البرامج التي استخدمتها ، لأنه برنامج مبني على أساس قوي ، تجد الراحة والمرونة في الاستخدام مع الأمان, بالإضافة إلى جميع التقارير للاستخدام المحاسبي أو لصاحب العمل ، مما يساعد في اتخاذ القرار الصحيح في الوقت المحدد.

source: Crystal View system provides the necessary time to conduct administrative and accounting operations in record time and helps in issuing reports, financial statements, audit and others
ar_eg: يوفر نظام كريستال فيو توفير الوقت اللازم لإجراء العمليات الإدارية والمحاسبية في وقت قياسي ويساعد في إصدار التقارير والكشوف المالية والمراجعة وغيرها

source: Data Quality
ar_eg: جودة البيانات

source: Delete
ar_eg: مسح

source: DeleteButton
ar_eg: مسح

source: DetailsButton
ar_eg: اظهار التفاصيل

source: Dr. Mohamed Al Henawy
ar_eg: الدكتور محمد الحناوي

source: Ease of use
ar_eg: سهولة الاستخدام

source: Ease of use is considered the most important features of Crystal software, as the company is working on developing its products to facilitate use in crystal systems and programs
ar_eg: تعتبر سهولة الاستخدام أهم ميزات برنامج كريستال، حيث تعمل الشركة على تطوير منتجاتها لتسهيل الاستخدام في أنظمة وبرامج كريستال

source: EditButton
ar_eg: تغير

source: ERP System
ar_eg: نظام تخطيط موارد المؤسسات

source: I have been working in the medical field since 2003 and I have used many programs, but when I used the Crystal View program, I did not find it easier to work and give me the appropriate reports and technical support that I find when I need it, starting from using this system, I always recommend it.
ar_eg: أعمل في المجال الطبي منذ عام 2003 واستخدمت العديد من البرامج ، ولكن عندما استخدمت برنامج كريستال فيو لم أجد أنه من الأسهل العمل وإعطائي التقارير المناسبة والدعم الفني الذي أجده عندما أحتاج إليه ، بدءًا من استخدام هذا النظام ، أوصي به دائمًا.

source: Integrated System
ar_eg: نظام متكامل

source: IsActive
ar_eg: نشط ؟

source: Language
ar_eg: اللغة

source: Login
ar_eg: الدخول

source: Monay Lamaay Rayes
ar_eg: موناي لمعي ريس

source: Mostafa Abbas
ar_eg: مصطفى عباس

source: Save Time
ar_eg: يوفر وقت

source: Search
ar_eg: البحث

source: SubSystemArabicName
ar_eg: اسم عربي للنظام الفرعي

source: SubSystemName
ar_eg: اسم النظام الفرعي

source: SubSystemShortName
ar_eg: اسم قصير للنظام الفرعي

source: The Crystal program is one of the best programs I have worked on because it has all your needs. It has strong reports for any employer and is easy to deal with. The most important need is also that the after-sales service exists and continues in a positive way, which is to distinguish any respectable program.
ar_eg: برنامج كريستال هو واحد من أفضل البرامج التي عملت عليها لأنه يحتوي على جميع احتياجاتك. لديها تقارير قوية لأي صاحب عمل ويسهل التعامل معها. الحاجة الأكثر أهمية هي أيضًا أن خدمة ما بعد البيع موجودة وتستمر بطريقة إيجابية ، وهي التمييز بين أي برنامج محترم.

source: The crystal system combines many specialized and integrated systems in all its parts, which makes it easy to update, develop and modify for customers to comply with the development and growth of their organizations
ar_eg: يجمع النظام كريستال بين العديد من الأنظمة المتخصصة والمتكاملة في جميع أجزائه ، مما يجعل منه سهل التحديث والتطوير والتعديل للعملاء ليتوافق مع مؤسساتهم

source: The integrated Crystal View system provides the effort of searching the books and works to organize documents and statements and extract detailed reports with ease and high quality
ar_eg: يوفر نظام كريستال فيو المتكامل مجهود البحث في الدفاتر ويعمل على تنظيم المستندات والكشوف واستخراج التقارير المفصلة بكل سهولة وجودة عالية

source: What people are saying...
ar_eg: ماذا يقول الناس ؟

source: With its responsive design and adaptive user interface, Crsytal View adapts seamlessly to different devices such as desktops, laptops, tablets, and smartphones, providing a consistent user experience.This flexibility allows employees, managers, and stakeholders to access and interact with critical business data, monitor real-time updates, and perform essential tasks from anywhere, whether they are in the office, on the go, or working remotely.
ar_eg: بفضل تصميمها المتجاوب وواجهة المستخدم التكيفية ، تتكيف كريستال فيو بسلاسة مع الأجهزة المختلفة مثل أجهزة الكمبيوتر المكتبية وأجهزة الكمبيوتر المحمولة والأجهزة اللوحية والهواتف الذكية ، مما يوفر تجربة مستخدم متسقة, وأصحاب المصلحة للوصول إلى بيانات الأعمال الهامة والتفاعل معها ، ومراقبة التحديثات في الوقت الحقيقي ، وأداء المهام الأساسية من أي مكان ، سواء كانوا في المكتب أو أثناء التنقل أو العمل عن بُعد.
